Revit 2027 API
SizingOptions(Element) Constructor
 Constructs a new instance of the SizingOptions with specified parameters.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SizingOptions(
	Element ductOrPipeCurve
)
Public Sub New (
	ductOrPipeCurve As Element
)
public:
SizingOptions(
	Element^ ductOrPipeCurve
)
new :
        ductOrPipeCurve : Element -> SizingOptions
Parameters
ductOrPipeCurve Element
 The element of a duct or pipe curve where the sizing parameters are extracted.
Exceptions
Exception | Condition
ArgumentException |  The element must be a valid duct or pipe curve object.
ArgumentNullException |  A non-optional argument was null
Remarks
 The sizing parameters are extracted from the specified curve element, including the curve domain and profile, roughness, fluid density and viscosity, the available size range, and etc.
See Also
Reference
SizingOptions Class
SizingOptions Overload
Autodesk.Revit.DB.Analysis Namespace